#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-hPSzRsfAfzkuBkje

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
module.infrastructure.module.database.digitalocean_database_cluster.api_db: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65]
module.infrastructure.module.content.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.module.content.random_password.elasticsearch_password: Refreshing state... [id=none]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.module.elasticsearch.aws_iam_user.elasticsearch: Refreshing state... [id=elasticsearch]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.content.aws_iam_user.github: Refreshing state... [id=github-spark-deploy]
module.infrastructure.module.elasticsearch.aws_s3_bucket.backup: Refreshing state... [id=foreign-language-reader-elasticsearch-backups]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.elasticsearch.aws_iam_access_key.elasticsearch: Refreshing state... [id=AKIAQRKEJGTPK4BHXIN6]
module.infrastructure.module.content.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPFPDKDIM2]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.frontend_preprod.aws_s3_bucket.main: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.api.digitalocean_database_db.api_database: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/database/foreign-language-reader-default]
module.infrastructure.module.api.digitalocean_database_user.api_user: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65/user/api-default]
module.infrastructure.module.database.digitalocean_database_firewall.allow_kubernetes: Refreshing state... [id=ea71992c-69be-4f47-aa38-20d9904d9c65-20210110103039465500000001]
module.infrastructure.module.nginx_ingress.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=default/application-secret]
module.infrastructure.module.language_service.kubernetes_horizontal_pod_autoscaler.language_service_autoscale: Refreshing state... [id=default/language-service]
module.infrastructure.module.language_service.kubernetes_deployment.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.content.kubernetes_role.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.language_service.kubernetes_service.language_service: Refreshing state... [id=default/language-service]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=default/api]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=default/api]
module.infrastructure.module.nginx_ingress.kubernetes_ingress.ingress: Refreshing state... [id=default/foreign-language-reader-ingress]
module.infrastructure.module.content.kubernetes_role_binding.prefect_agent: Refreshing state... [id=default/prefect-agent-rbac]
module.infrastructure.module.content.kubernetes_secret.spark_config: Refreshing state... [id=default/spark-config]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_aws_credentials: Refreshing state... [id=default/elasticsearch-s3-creds]
module.infrastructure.module.elasticsearch.kubernetes_secret.elasticsearch_roles: Refreshing state... [id=default/elasticsearch-roles]
module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate: Refreshing state... [id=default/nginx-certificate]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=default/elasticsearch-credentials]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.kubernetes_service_account.prefect_agent: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.elasticsearch.helm_release.elasticsearch: Refreshing state... [id=elastic-operator]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.prometheus_operator: Refreshing state... [id=prometheus]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.api.kubernetes_secret.api_database_credentials: Refreshing state... [id=default/api-database-credentials]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.content.kubernetes_deployment.prefect: Refreshing state... [id=default/prefect-agent]
module.infrastructure.module.frontend_preprod.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3F8QDRJGU7DO0]
module.infrastructure.module.frontend_preprod.aws_s3_bucket_policy.public_access: Refreshing state... [id=preprod.foreignlanguagereader.com]
module.infrastructure.module.elasticsearch.digitalocean_record.kibana_subdomain_dns: Refreshing state... [id=128308865]
module.infrastructure.module.elasticsearch.digitalocean_record.elastic_subdomain_dns: Refreshing state... [id=128308864]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.content.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-deploy-role]
module.infrastructure.module.content.aws_iam_policy.spark_write: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-write-role]
module.infrastructure.module.elasticsearch.aws_iam_policy.elasticsearch_backup: Refreshing state... [id=arn:aws:iam::037187302622:policy/elasticsearch-backup-role]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.frontend_preprod.digitalocean_record.subdomain: Refreshing state... [id=135753207]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.content.aws_iam_policy_attachment.deploy: Refreshing state... [id=spark-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_repository.backups: Refreshing state... [id=S3-backup]
module.infrastructure.module.elasticsearch.elasticsearch_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.elasticsearch.elasticsearch_user.fluentd: Refreshing state... [id=fluentd]
module.infrastructure.module.elasticsearch.elasticsearch_user.api: Refreshing state... [id=apiprod]
module.infrastructure.module.nginx_ingress.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=128302476]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_write: Refreshing state... [id=spark-write-role-attach]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend_preprod.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/preprod.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.elasticsearch.aws_iam_policy_attachment.elasticsearch_backup: Refreshing state... [id=elasticsearch-backup-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_snapshot_lifecycle_policy.daily_backup: Refreshing state... [id=daily-snapshots]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=default/api]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_lifecycle_policy.rollover: Refreshing state... [id=logging-rollover]
module.infrastructure.module.frontend_preprod.aws_iam_policy_attachment.deploy: Refreshing state... [id=preprod.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd: Refreshing state... [id=fluentd]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        id             = "2132b4c2-fd9e-496c-8419-a39da7d142f0"
        name           = "foreign-language-reader"
        tags           = [
            "prod",
        ]
        # (13 unchanged attributes hidden)

      ~ node_pool {
            id                = "12a755da-7985-4c6b-9634-94d74d772251"
          ~ max_nodes         = 15 -> 5
            name              = "worker-pool"
            tags              = []
            # (7 unchanged attributes hidden)
        }
    }

  # module.infrastructure.acme_certificate.certificate will be updated in-place
  ~ resource "acme_certificate" "certificate" {
      ~ certificate_domain           = "*.foreignlanguagereader.com" -> (known after apply)
      ~ certificate_p12              = (sensitive value)
      ~ certificate_pem              = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIFPjCCBCagAwIBAgISBIWBRAu8703vw9xO+kIkQWhiMA0GCSqGSIb3DQEBCwUA
            MDIxCzAJBgNVBAYTAlVTMRYwFAYDVQQKEw1MZXQncyBFbmNyeXB0MQswCQYDVQQD
            EwJSMzAeFw0yMDEyMjAxODQ0MzBaFw0yMTAzMjAxODQ0MzBaMCYxJDAiBgNVBAMM
            GyouZm9yZWlnbmxhbmd1YWdlcmVhZGVyLmNvbTCCASIwDQYJKoZIhvcNAQEBBQAD
            ggEPADCCAQoCggEBAOJeP5miwkqKVFZTEL75JU+4qc/KECQ3+HdNTCD16DnOQi1n
            qdC/8CJmpD/3OY+dDbzgjPeYDUAHb9YLXaOc0Rewo7gFRygks5CTSUbgy5cLseCw
            NSLckVB3rrt2q9V+cBQHUyltIm/6LC2xXLFDi5KVPx++N0qhvPbPefG5nWq/VpWC
            hq5c6kpI80Wez0EL+9pBODwtU1wHx21q3Ys2KtLo/5ihUR9aRMaTUlRxiv6igleH
            bFVSbX9RYDNIMpiNMFUMkMFEkH55T6aIPZGhILRS/no4oToXRjJlr9b686yws/dS
            n2iHCT37eRFesz9u3kD9ZRUdE1Gzn4oYGlqZkycCAwEAAaOCAlgwggJUMA4GA1Ud
            DwEB/wQEAwIFoDAdBgNVHSUEFjAUBggrBgEFBQcDAQYIKwYBBQUHAwIwDAYDVR0T
            AQH/BAIwADAdBgNVHQ4EFgQUlaRsI3FHN3cg5QGlKwgF2thizlswHwYDVR0jBBgw
            FoAUFC6zF7dYVsuuUAlA5h+vnYsUwsYwVQYIKwYBBQUHAQEESTBHMCEGCCsGAQUF
            BzABhhVodHRwOi8vcjMuby5sZW5jci5vcmcwIgYIKwYBBQUHMAKGFmh0dHA6Ly9y
            My5pLmxlbmNyLm9yZy8wJgYDVR0RBB8wHYIbKi5mb3JlaWdubGFuZ3VhZ2VyZWFk
            ZXIuY29tMEwGA1UdIARFMEMwCAYGZ4EMAQIBMDcGCysGAQQBgt8TAQEBMCgwJgYI
            KwYBBQUHAgEWGmh0dHA6Ly9jcHMubGV0c2VuY3J5cHQub3JnMIIBBgYKKwYBBAHW
            eQIEAgSB9wSB9ADyAHcAfT7y+I//iFVoJMLAyp5SiXkrxQ54CX8uapdomX4i8NcA
            AAF2ga6VqAAABAMASDBGAiEAnTPxo6vLRJr9i9FIoII77ugjPQ+ldUkSka0SUxWt
            ffYCIQDzdfsKYBpNlg1bKaDejtXkMW36QNJyLgAUmP34uTrpIQB3AJQgvB6O1Y1s
            iHMfgosiLA3R2k1ebE+UPWHbTi9YTaLCAAABdoGulX0AAAQDAEgwRgIhAMGIL495
            Kio9fVDcpeGSRlz57WsU8BTlNrGenuIZUPJsAiEAwHlxhNZOdQQwQ4zBgS/5M+bN
            WnF02L7UNH4LBoEEG34wDQYJKoZIhvcNAQELBQADggEBABYL/LrGycuJ20Psu6G+
            UHw7Ht7ZuZM0zk7myxyN26klMtgZiYGM06EacwrbwLxo5zh+yoVjtes2GIFkhn5c
            6yDAoLAsJSV1kwzWGG9rGb3O08jklvwHtbSByLhJm44Ttz9z/jaaurbxQ+++FFpt
            THNCVRQVL52Xv0ABIYsWD7BD5RtKVRYj1lUjFisqQ0OL/lzazmx/i4YpzfoCnhHq
            hKsuzyIkEdpd9Cx8R/wD8GXzJwHSodh2/MwwuYaaleDTRQFhUu80Rwr9fW3KK0Qr
            p5qQ38AfBuKiSQxhqv1WaUm7p8v8dfTDXih2pVfz8ydHHZQPnWd4xWHjrjq5OhNw
            tto=
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ certificate_url              = "https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862" -> (known after apply)
        id                           = "https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862"
      ~ issuer_pem                   = <<-EOT
            -----BEGIN CERTIFICATE-----
            MIIEZTCCA02gAwIBAgIQQAF1BIMUpMghjISpDBbN3zANBgkqhkiG9w0BAQsFADA/
            MSQwIgYDVQQKExtEaWdpdGFsIFNpZ25hdHVyZSBUcnVzdCBDby4xFzAVBgNVBAMT
            DkRTVCBSb290IENBIFgzMB4XDTIwMTAwNzE5MjE0MFoXDTIxMDkyOTE5MjE0MFow
            MjELMAkGA1UEBhMCVVMxFjAUBgNVBAoTDUxldCdzIEVuY3J5cHQxCzAJBgNVBAMT
            AlIzMIIBIjANBgkqhkiG9w0BAQEFAAOCAQ8AMIIBCgKCAQEAuwIVKMz2oJTTDxLs
            jVWSw/iC8ZmmekKIp10mqrUrucVMsa+Oa/l1yKPXD0eUFFU1V4yeqKI5GfWCPEKp
            Tm71O8Mu243AsFzzWTjn7c9p8FoLG77AlCQlh/o3cbMT5xys4Zvv2+Q7RVJFlqnB
            U840yFLuta7tj95gcOKlVKu2bQ6XpUA0ayvTvGbrZjR8+muLj1cpmfgwF126cm/7
            gcWt0oZYPRfH5wm78Sv3htzB2nFd1EbjzK0lwYi8YGd1ZrPxGPeiXOZT/zqItkel
            /xMY6pgJdz+dU/nPAeX1pnAXFK9jpP+Zs5Od3FOnBv5IhR2haa4ldbsTzFID9e1R
            oYvbFQIDAQABo4IBaDCCAWQwEgYDVR0TAQH/BAgwBgEB/wIBADAOBgNVHQ8BAf8E
            BAMCAYYwSwYIKwYBBQUHAQEEPzA9MDsGCCsGAQUFBzAChi9odHRwOi8vYXBwcy5p
            ZGVudHJ1c3QuY29tL3Jvb3RzL2RzdHJvb3RjYXgzLnA3YzAfBgNVHSMEGDAWgBTE
            p7Gkeyxx+tvhS5B1/8QVYIWJEDBUBgNVHSAETTBLMAgGBmeBDAECATA/BgsrBgEE
            AYLfEwEBATAwMC4GCCsGAQUFBwIBFiJodHRwOi8vY3BzLnJvb3QteDEubGV0c2Vu
            Y3J5cHQub3JnMDwGA1UdHwQ1MDMwMaAvoC2GK2h0dHA6Ly9jcmwuaWRlbnRydXN0
            LmNvbS9EU1RST09UQ0FYM0NSTC5jcmwwHQYDVR0OBBYEFBQusxe3WFbLrlAJQOYf
            r52LFMLGMB0GA1UdJQQWMBQGCCsGAQUFBwMBBggrBgEFBQcDAjANBgkqhkiG9w0B
            AQsFAAOCAQEA2UzgyfWEiDcx27sT4rP8i2tiEmxYt0l+PAK3qB8oYevO4C5z70kH
            ejWEHx2taPDY/laBL21/WKZuNTYQHHPD5b1tXgHXbnL7KqC401dk5VvCadTQsvd8
            S8MXjohyc9z9/G2948kLjmE6Flh9dDYrVYA9x2O+hEPGOaEOa1eePynBgPayvUfL
            qjBstzLhWVQLGAkXXmNs+5ZnPBxzDJOLxhF2JIbeQAcH5H0tZrUlo5ZYyOqA7s9p
            O5b85o3AM/OJ+CktFBQtfvBhcJVd9wvlwPsk+uyOy2HI7mNxKKgsBTt375teA2Tw
            UdHkhVNcsAKX1H7GNNLOEADksd86wuoXvg==
            -----END CERTIFICATE-----
        EOT -> (known after apply)
      ~ private_key_pem              = (sensitive value)
        # (6 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.infrastructure.module.content.aws_iam_policy.spark_read will be updated in-place
  ~ resource "aws_iam_policy" "spark_read" {
        id          = "arn:aws:iam::037187302622:policy/spark-read-role"
        name        = "spark-read-role"
      ~ policy      = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListStorageLensConfigurations",
                          - "s3:GetAccessPoint",
                          - "s3:PutAccountPublicAccessBlock",
                          - "s3:GetAccountPublicAccessBlock",
                          - "s3:ListAllMyBuckets",
                          - "s3:ListAccessPoints",
                          - "s3:ListJobs",
                          - "s3:PutStorageLensConfiguration",
                          - "s3:CreateJob",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                        ]
                      ~ Resource = "*" -> "arn:aws:s3:::foreign-language-reader-content/*"
                      ~ Sid      = "VisualEditor0" -> ""
                        # (1 unchanged element hidden)
                    },
                  - {
                      - Action   = "s3:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                      - Sid      = "VisualEditor1"
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (3 unchanged attributes hidden)
    }

  # module.infrastructure.module.elasticsearch.elasticsearch_index_template.fluentd will be updated in-place
  ~ resource "elasticsearch_index_template" "fluentd" {
        id       = "fluentd"
        name     = "fluentd"
      ~ template = jsonencode(
          ~ {
              - fluentd        = {
                  - aliases        = {}
                  - index_patterns = [
                      - "logstash-*",
                    ]
                  - mappings       = {}
                  - order          = 0
                  - settings       = {
                      - index = {
                          - lifecycle = {
                              - name           = "logging-rollover"
                              - rollover_alias = "logstash-backup-alias"
                            }
                        }
                    }
                } -> null
              + index_patterns = [
                  + "logstash-*",
                ]
              + settings       = {
                  + index.lifecycle.name           = "logging-rollover"
                  + index.lifecycle.rollover_alias = "logstash-backup-alias"
                }
            }
        )
    }

  # module.infrastructure.module.nginx_ingress.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      ~ id                    = "default/nginx-ingress-nginx-ingress" -> (known after apply)
      ~ load_balancer_ingress = [
          - {
              - hostname = ""
              - ip       = "159.89.223.61"
            },
        ] -> (known after apply)
      ~ spec                  = [
          - {
              - cluster_ip                  = "10.245.179.1"
              - external_ips                = []
              - external_name               = ""
              - external_traffic_policy     = "Local"
              - health_check_node_port      = 30696
              - load_balancer_ip            = ""
              - load_balancer_source_ranges = []
              - port                        = [
                  - {
                      - name        = "http"
                      - node_port   = 32728
                      - port        = 80
                      - protocol    = "TCP"
                      - target_port = "80"
                    },
                  - {
                      - name        = "https"
                      - node_port   = 30763
                      - port        = 443
                      - protocol    = "TCP"
                      - target_port = "443"
                    },
                ]
              - publish_not_ready_addresses = false
              - selector                    = {
                  - "app" = "nginx-ingress-nginx-ingress"
                }
              - session_affinity            = "None"
              - type                        = "LoadBalancer"
            },
        ] -> (known after apply)

      ~ metadata {
          - annotations      = {
              - "kubernetes.digitalocean.com/load-balancer-id" = "fd4753a2-359a-40d6-b9df-682beb1a1877"
              - "meta.helm.sh/release-name"                    = "nginx-ingress"
              - "meta.helm.sh/release-namespace"               = "default"
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {
              - "helm.sh/chart" = "nginx-ingress-0.7.1"
            } -> null
            name             = "nginx-ingress-nginx-ingress"
          ~ resource_version = "2358536" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/default/services/nginx-ingress-nginx-ingress" -> (known after apply)
          ~ uid              = "e0715062-0c45-4276-b6b8-5ee11c0d4d35" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.infrastructure.module.nginx_ingress.kubernetes_secret.nginx_certificate will be updated in-place
  ~ resource "kubernetes_secret" "nginx_certificate" {
      ~ data = (sensitive value)
        id   = "default/nginx-certificate"
        # (1 unchanged attribute hidden)

        # (1 unchanged block hidden)
    }

Plan: 0 to add, 5 to change, 0 to destroy.

Warning: Release does not exist

Release name: spark does not exist. It may have been deleted outside of
Terraform

```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
